openfoam_runs/run_0008/Allrun
#!/bin/bash
# Allrun — run the full hull resistance simulation
# Usage: bash Allrun  (from inside the case directory)

set -e

OF_BASHRC="/usr/lib/openfoam/openfoam2406/etc/bashrc"

run() {
    echo "=== $1 ==="
    bash --norc --noprofile -c "source $OF_BASHRC 2>/dev/null; cd $(pwd); $1"
}

run "surfaceFeatureExtract"
run "blockMesh"
run "snappyHexMesh -overwrite"
run "simpleFoam"

echo "=== Done ==="
echo "Drag force is in postProcessing/forces/0/force.dat"
